blogs/socket_fd_leak_2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-07-07 Tue 16:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>又一次排查socket fd泄漏</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="zzyongx" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">又一次排查socket fd泄漏</h1>
<p>
距离上一次 <a href="https://zzyongx.github.io/blogs/socket_fd_leak.html">socket fd泄漏</a> 已经过去很久了，我再次碰到了 socket fd 泄漏的情况。相比上次的徒增，这次是缓慢增长，解决起来容易很多。这次决定换用更简单的方法，找找fd在哪泄漏的。
</p>

<div id="outline-container-org65e418e" class="outline-2">
<h2 id="org65e418e"><span class="section-number-2">1</span> 查找方法</h2>
<div class="outline-text-2" id="text-1">
<p>
思路是利用strace，跟踪 <code>socket,connect,accept4,close</code> 4个系统调用一段时间，然后用netstat查看当前连接用的inode，和 proc 下的fd inode对比，不在netstat中的inode就是泄漏的inode，最后对比strace里面记录的fd，查看这些fd是怎么创建的。写成脚本如下：
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #ffff00;">#</span><span style="color: #ffff00;">!/bin/</span><span style="color: #00ffff; font-weight: bold;">bash</span>

<span style="color: #ffff00;">PID</span>=911
<span style="color: #ffff00;">DURATION</span>=3600

strace -tt -f -p $<span style="color: #ffff00;">PID</span> -e <span style="color: #ffff00;">trace</span>=socket,connect,accept4,close 2&gt;&amp;1 | grep -v SIGURG &gt; tcp.log &amp;
sleep $<span style="color: #ffff00;">DURATION</span>

netstat -tenp | grep api | sort -k 8 &gt; netstat.txt
ls /proc/$<span style="color: #ffff00;">PID</span>/fd -l | grep socket | perl -ane <span style="color: #00ff00;">'$F[10] =~ /socket:\[(\d+)\]/; print $F[8], " ", $1, "\n"'</span> | sort -k 2 &gt; fd.txt

<span style="color: #00ffff; font-weight: bold;">for</span> fd<span style="color: #00ffff; font-weight: bold;"> in</span> $(<span style="color: #fa8072;">join</span> -v 1 -1 2 -2 8 fd.txt netstat.txt | cut -d<span style="color: #00ff00;">' '</span> -f2); <span style="color: #00ffff; font-weight: bold;">do</span>
  <span style="color: #ffff00;">F</span>=/proc/$<span style="color: #ffff00;">PID</span>/fd/$<span style="color: #ffff00;">fd</span>
  <span style="color: #0000ff; font-weight: bold;">test</span> -e $<span style="color: #ffff00;">F</span> &amp;&amp; {
    ls -l $<span style="color: #ffff00;">F</span>
    grep -w $<span style="color: #ffff00;">fd</span> tcp.log | tail
  }
<span style="color: #00ffff; font-weight: bold;">done</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org69a3ee4" class="outline-2">
<h2 id="org69a3ee4"><span class="section-number-2">2</span> 查找问题根源</h2>
<div class="outline-text-2" id="text-2">
<p>
这次仍然是accept出的fd没释放，说明某些请求hang住了没有结束，亏得是go routine，系统没崩。查看go routine很容易找出问题所在。
</p>
</div>
</div>

<div id="outline-container-org230f41d" class="outline-2">
<h2 id="org230f41d"><span class="section-number-2">3</span> 思考</h2>
<div class="outline-text-2" id="text-3">
<p>
类似web这种服务模式，很容易出现某些接口太耗时或有BUG，导致资源逐渐耗尽的情况。监控socket fd的使用是个不错的办法。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: zzyongx</p>
<p class="date">Created: 2020-07-07 Tue 16:16</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
